{"id":11657,"date":"2015-12-07T13:25:48","date_gmt":"2015-12-07T13:25:48","guid":{"rendered":"http:\/\/46.101.193.202\/?p=11657"},"modified":"2020-03-18T11:56:21","modified_gmt":"2020-03-18T10:56:21","slug":"ipcc","status":"publish","type":"post","link":"https:\/\/www.seqan.de\/ipcc\/","title":{"rendered":"New IPCC"},"content":{"rendered":"<p>The Intel® PCC program supports universities, institutions, and labs identified as leaders in their fields. It focuses on modernizing applications or software libraries to increase performance on modern microprocessors and coprocessors using parallel computing.<\/p>\n<p>Parallel computing involves the simultaneous operation of multiple processors running elements of a computer program at the same time and is hence much faster than executing the operations sequentially, one after another. This necessitates routines to address the proper use of cores, caches, threads, and vector capabilities of the hardware as well as synchronization routines for parallel computations.<\/p>\n<p>The latest <a href=\"https:\/\/software.intel.com\/en-us\/articles\/intel-parallel-computing-center-at-freie-universitat-berlin\">Intel® PCC<\/a> will be led by Knut Reinert, who is professor for Bioinformatics at the department of Mathematics and Computer Science at Freie Universität (FU) Berlin and a fellow at the Max-Planck-Institute for Molecular Genetics. Mr. Reinert’s research focuses on providing efficient tools for the analysis of Next Generation Sequencing (NGS) data stemming from a technology breakthrough several years ago which enables the cheap sequencing of terabytes of genomic sequence. The Reinert lab based its application development on well-designed algorithmic components and their implementation in the <a href=\"https:\/\/www.seqan.de\/\">SeqAn C++ software library<\/a>.<\/p>\n<p>The SeqAn library is well-established and used worldwide in numerous analysis tools for NGS analysis. Since this year, it has also been supported in the CIBI center as part of the German bioinformatics infrastructure network (de.NBI), demonstrating its leading role in the development of new analysis tools for biomedical applications.<\/p>\n<p><em>“We are very glad that Intel supports our vision for moving biomedical software development forward. SeqAn is a software library containing well designed key components for sequence analysis and we always thought that parallelizing and vectorizing key components of SeqAn will have a big impact on the field by accelerating many applications that make use of those components.”<\/em><\/p>\n<p><strong>Knut Reinert, PI<\/strong><\/p>\n<p>The center will work on abstracting primitives in SeqAn’s template based core to offer a unified interface to multicore and SIMD vector units including the Intel® Xeon and Intel® Xeon Phi™ coprocessors and then accelerate key routines like alignment algorithms or traversing data parallel containers. The generic design of SeqAn makes it well-suited for this approach.<\/p>\n<p><em>&#8220;Intel regards SeqAn as a very promising software package that has all the right ingredients to considerably speed up Next Generation Sequencing analysis on modern Intel processors. We are looking forward to collaborating with Professor Reinert and his team to add our technical know-how about Intel® Architecture and combine it with his algorithmic expertise, and in this way turn SeqAn into a premier software tool in this domain of rapidly growing importance.”<\/em><\/p>\n<p><strong>Kristina Kermanshahche<\/strong><br \/>\n<strong> Chief Architect, Intel® Health &amp; Life Sciences<\/strong><\/p>\n<p>The above strategy will accelerate existing and future applications based on the free SeqAn library (under BSD license) and make hardware acceleration easily available for developers. The FU Berlin will benefit from its role as an Intel® PCC by working with Intel experts and their software tools, and advanced technologies. The Reinert lab will incorporate its work in advanced tutorials and courses at FU Berlin and looks forward to sharing its findings at conferences such as the International Supercomputing Conference and the Intel® Xeon Phi™ Coprocessor User Group (IXPUG) meetings.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Intel® PCC program supports universities, institutions, and labs identified as leaders in their fields. It focuses on modernizing applications or software libraries to increase performance on modern microprocessors and coprocessors using parallel computing. Parallel computing involves the simultaneous operation of multiple processors running elements of a computer program at the same time and is [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":11780,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[51],"_links":{"self":[{"href":"https:\/\/www.seqan.de\/wp-json\/wp\/v2\/posts\/11657"}],"collection":[{"href":"https:\/\/www.seqan.de\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.seqan.de\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.seqan.de\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.seqan.de\/wp-json\/wp\/v2\/comments?post=11657"}],"version-history":[{"count":11,"href":"https:\/\/www.seqan.de\/wp-json\/wp\/v2\/posts\/11657\/revisions"}],"predecessor-version":[{"id":12381,"href":"https:\/\/www.seqan.de\/wp-json\/wp\/v2\/posts\/11657\/revisions\/12381"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.seqan.de\/wp-json\/wp\/v2\/media\/11780"}],"wp:attachment":[{"href":"https:\/\/www.seqan.de\/wp-json\/wp\/v2\/media?parent=11657"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.seqan.de\/wp-json\/wp\/v2\/categories?post=11657"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.seqan.de\/wp-json\/wp\/v2\/tags?post=11657"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}